In [1]:
import numpy as np
import pandas as pd

In [2]:
#Importamos csv
df=pd.read_csv('HR RAW DATA.csv')
df.head()

,Unnamed: 0,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,employeecount,...,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YEARSWITHCURRMANAGER,SameAsMonthlyIncome,DateBirth,Salary,RoleDepartament,NUMBERCHILDREN,RemoteWork
0,0,51,No,NaN,"684,0$",NaN,6,3,NaN,1,...,20,NaN,15,15,"19537,0",1972,1000000000$,NaN,NaN,Yes
1,1,52,No,NaN,"699,0$",NaN,1,4,Life Sciences,1,...,33,NaN,11,9,"19999,0",1971,1000000000$,NaN,NaN,1
2,2,42,No,travel_rarely,"532,0$",Research & Development,4,2,Technical Degree,1,...,22,NaN,11,15,"19232,0",1981,1000000000$,ManaGER - Research & Development,NaN,1
3,3,47,No,travel_rarely,"359,0$",NaN,2,4,Medical,1,...,20,NaN,5,6,"17169,0",1976,1000000000$,NaN,NaN,False
4,4,46,No,NaN,"1319,0$",NaN,3,3,Technical Degree,1,...,19,NaN,2,8,NaN,1977,1000000000$,NaN,NaN,0

In [3]:
#Creamos nueva variable para guardar la selecci칩n del rango de columnas que queremos.
#Este ser치 nuestro csv
df_data=df.iloc[:, 1:]
df_data

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,employeecount,employeenumber,...,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YEARSWITHCURRMANAGER,SameAsMonthlyIncome,DateBirth,Salary,RoleDepartament,NUMBERCHILDREN,RemoteWork
0,51,No,NaN,"684,0$",NaN,6,3,NaN,1,"162,0",...,20,NaN,15,15,"19537,0",1972,1000000000$,NaN,NaN,Yes
1,52,No,NaN,"699,0$",NaN,1,4,Life Sciences,1,"259,0",...,33,NaN,11,9,"19999,0",1971,1000000000$,NaN,NaN,1
2,42,No,travel_rarely,"532,0$",Research & Development,4,2,Technical Degree,1,"319,0",...,22,NaN,11,15,"19232,0",1981,1000000000$,ManaGER - Research & Development,NaN,1
3,47,No,travel_rarely,"359,0$",NaN,2,4,Medical,1,NaN,...,20,NaN,5,6,"17169,0",1976,1000000000$,NaN,NaN,False
4,46,No,NaN,"1319,0$",NaN,3,3,Technical Degree,1,NaN,...,19,NaN,2,8,NaN,1977,1000000000$,NaN,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1609,36,Yes,travel_rarely,"530,0$",NaN,3,1,Life Sciences,1,"967,0",...,16,NaN,3,7,"10325,0",1987,1000000000$,NaN,NaN,0
1610,45,No,non-travel,"805,0$",NaN,4,2,NaN,1,"972,0",...,9,NaN,0,8,"4447,0",1978,1000000000$,NaN,NaN,1
1611,39,No,travel_rarely,"903,0$",NaN,-13,5,NaN,1,NaN,...,8,NaN,0,7,NaN,1984,1000000000$,NaN,NaN,Yes
1612,36,No,non-travel,"1229,0$",NaN,8,4,Technical Degree,1,"990,0",...,7,NaN,0,7,NaN,1987,1000000000$,NaN,NaN,True
1613,46,No,NaN,"566,0$",NaN,7,2,Medical,1,NaN,...,8,NaN,0,7,"10845,0",1977,1000000000$,NaN,NaN,0

In [4]:
#Visualizamos la informaci칩n b치sica del DataFram
df_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1614 entries, 0 to 1613
Data columns (total 41 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Age                       1614 non-null   object
 1   Attrition                 1614 non-null   object
 2   BusinessTravel            842 non-null    object
 3   DailyRate                 1614 non-null   object
 4   Department                302 non-null    object
 5   DistanceFromHome          1614 non-null   int64
 6   Education                 1614 non-null   int64
 7   EducationField            869 non-null    object
 8   employeecount             1614 non-null   int64
 9   employeenumber            1183 non-null   object
 10  EnvironmentSatisfaction   1614 non-null   int64
 11  Gender                    1614 non-null   int64
 12  HourlyRate                1614 non-null   object
 13  JobInvolvement            1614 non-null   int64
 14  JobLevel                  1614 non-null   int64
 15  JobRole                   1614 non-null   object
 16  JobSatisfaction           1614 non-null   int64
 17  MaritalStatus             963 non-null    object
 18  MonthlyIncome             771 non-null    object
 19  MonthlyRate               1614 non-null   int64
 20  NUMCOMPANIESWORKED        1614 non-null   int64
 21  Over18                    713 non-null    object
 22  OverTime                  938 non-null    object
 23  PercentSalaryHike         1614 non-null   int64
 24  PerformanceRating         1419 non-null   object
 25  RelationshipSatisfaction  1614 non-null   int64
 26  StandardHours             419 non-null    object
 27  StockOptionLevel          1614 non-null   int64
 28  TOTALWORKINGYEARS         1088 non-null   object
 29  TrainingTimesLastYear     1614 non-null   int64
 30  WORKLIFEBALANCE           1506 non-null   object
 31  YearsAtCompany            1614 non-null   int64
 32  YearsInCurrentRole        34 non-null     object
 33  YearsSinceLastPromotion   1614 non-null   int64
 34  YEARSWITHCURRMANAGER      1614 non-null   int64
 35  SameAsMonthlyIncome       771 non-null    object
 36  DateBirth                 1614 non-null   int64
 37  Salary                    1614 non-null   object
 38  RoleDepartament           302 non-null    object
 39  NUMBERCHILDREN            0 non-null      float64
 40  RemoteWork                1614 non-null   object
dtypes: float64(1), int64(18), object(22)
memory usage: 517.1+ KB

In [5]:
#Exportamos el csv
df_data.to_csv('hr_data.csv', index=False)

In [ ]:
#celda marga

In [ ]:
#celda sharon

In [6]:
#celda isa
df_col_3=df_data.iloc[:, 20:30]
df_col_3

,NUMCOMPANIESWORKED,Over18,OverTime,PercentSalaryHike,PerformanceRating,RelationshipSatisfaction,StandardHours,StockOptionLevel,TOTALWORKINGYEARS,TrainingTimesLastYear
0,7,Y,No,13,"3,0",3,NaN,0,NaN,5
1,0,NaN,NaN,14,"3,0",1,NaN,1,"34,0",5
2,1,NaN,No,11,"3,0",4,NaN,0,"22,0",3
3,3,Y,NaN,19,"3,0",2,NaN,2,NaN,2
4,2,Y,No,12,"3,0",4,NaN,1,NaN,5
...,...,...,...,...,...,...,...,...,...,...
1609,1,Y,NaN,11,NaN,1,NaN,1,NaN,6
1610,1,NaN,NaN,12,"3,0",2,NaN,0,NaN,5
1611,0,NaN,No,18,"3,0",4,NaN,0,"9,0",3
1612,4,NaN,No,13,NaN,4,NaN,2,"12,0",3
1613,6,Y,NaN,13,"3,0",2,NaN,1,NaN,3

In [7]:
#Veo la info de cada columna
df_col_3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1614 entries, 0 to 1613
Data columns (total 10 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   NUMCOMPANIESWORKED        1614 non-null   int64
 1   Over18                    713 non-null    object
 2   OverTime                  938 non-null    object
 3   PercentSalaryHike         1614 non-null   int64
 4   PerformanceRating         1419 non-null   object
 5   RelationshipSatisfaction  1614 non-null   int64
 6   StandardHours             419 non-null    object
 7   StockOptionLevel          1614 non-null   int64
 8   TOTALWORKINGYEARS         1088 non-null   object
 9   TrainingTimesLastYear     1614 non-null   int64
dtypes: int64(5), object(5)
memory usage: 126.2+ KB

1. Estandarizamos los nombres de las columnas

In [12]:
#Quitamos espacios en blanco, en caso de que los haya
#Utilizamos str.replace() para asegurarnos que se eliminan los espacios entre palabras, de haberlos.

#1. Creamos lista con los nuevos nombres de las columnas
#2. Iteramos las columnas del df
new_columns=[i.replace(' ', '') for i in df_col_3.columns]
#3. Asignamos los nuevos nombres de columnas al df
df_col_3.columns=new_columns

In [13]:
# 游딈勇끂n#Visualizamos para ver que sali칩 bien
df_col_3.head(1)

,NUMCOMPANIESWORKED,Over18,OverTime,PercentSalaryHike,PerformanceRating,RelationshipSatisfaction,StandardHours,StockOptionLevel,TOTALWORKINGYEARS,TrainingTimesLastYear
0,7,Y,No,13,"3,0",3,NaN,0,NaN,5

In [15]:
#Pasamos todo a min칰sculas
new_columns2=[i.lower() for i in df_col_3.columns]
df_col_3.columns=new_columns2

In [16]:
# 游딈勇끂n#Visualizamos para ver que sali칩 bien
df_col_3.head(1)

,numcompaniesworked,over18,overtime,percentsalaryhike,performancerating,relationshipsatisfaction,standardhours,stockoptionlevel,totalworkingyears,trainingtimeslastyear
0,7,Y,No,13,"3,0",3,NaN,0,NaN,5

In [ ]:
#celda silvia

In [ ]:
#celda lidia